tutorials/uweBourdonBoringReference/0/W
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "576";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.01 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
	value		uniform (0 0.1 0);
    }
    innerRadius
    {
        type            zeroGradient;
    }
    outerRadius
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    leftHand
    {
        type            zeroGradient;
    }
    rightHand
    {
        type            zeroGradient;
    }	
	
}


// ************************************************************************* //
